let forge = new Product(
  "forge",
  `Вибір <strong>справжнього</strong> геймера, є все для <strong>комфортної</strong> гри`,
  "2 974 грн",
  "./img/hero/forge.png",
  [
    "7.1 об’ємний звук",
    "Власний еквалайзер",
    "Фірмова піна з памяттю форми",
    "RGB освітлення — 16млн кольорів",
  ],
  [
    "Номінальна потужність: 10 мВт",
    "Максимальна потужність: 30 мВт",
    "Тип роз'єму: USB",
    "Кабель гарнітури: Ø4 мм x 1,3 м",
    "Вага нетто:  приблизно 322 г",
  ]
);

let shade = new Product(
  "shade",
  "<strong>Надлегкі</strong> та <strong>комфортні</strong>, забезпечать вам <strong>довгу</strong> та водночас <strong>комфортну</strong> гру",
  "3 032 грн",
  "./img/hero/shade.png",
  [
    "Надлегкі — 235г",
    "Фірмова піна з памяттю форми",
    "З’ємний мікрофон з высокою чутливістю",
  ],
  [
    "Номінальна потужність: 15 мВт",
    "Максимальна потужність: 40 мВт",
    "Тип роз'єму: 3,5 мм",
    "Кабель гарнітури: Ø4 мм x 1,2 м",
    "Подовжувач Y-типу: Ø4 мм x 2 м",
    "Вага нетто: приблизно 235 г (без кабелю)",
  ]
);

let flit = new Product(
  "flit",
  "<strong>Найгучніший</strong> звук завдяки динаміку діаметром <strong>53мм</strong>",
  "2 427 грн",
  "./img/hero/flit.png",
  [
    "Потужний звук в 250мВт",
    "Фірмова піна з памяттю форми",
    "З’ємний мікрофон з высокою чутливістю",
  ],
  [
    "Номінальна потужність: 100 мВт",
    "Максимальна потужність: 250 мВт",
    "Тип роз'єму: 3,5 мм",
    "Кабель гарнітури: Ø4 мм x 1,3 м",
    "Подовжувач Y-типу: Ø4 мм x 2 м",
    "Вага нетто: приблизно 260 г",
  ]
);

let newSlider = new HeroSlider();
newSlider.addSlide(forge, shade, flit);
newSlider.createSlide();

let prod = new Product360();
prod.addProduct(forge, shade, flit);
prod.createProducts();
